# Представлен список чисел. Необходимо вывести элементы исходного списка, значения которых больше предыдущего элемента.
# Подсказка: элементы, удовлетворяющие условию, оформить в виде списка. Для формирования списка использовать генератор.
# Пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55].
# Результат: [12, 44, 4, 10, 78, 123].

from random import randint

my_list = [randint(0, 1000) for i in range(15)]
result = [k for i, j in enumerate(my_list) for k in my_list[i + 1:i + 2] if k > j]
print("Исходный список ", my_list)
print("Результат ", result)
